//
//  story.swift
//  rennai2
//
//  Created by 高井佑月 on 2023/05/26.
//

import Foundation

class Story {
    var himariserihu: [String] = ["ﾀﾅｶ君おはよーねえ！なんか気づかない？",
                                  "おーやっぱ分かってるなーどうどう？似合ってる？",
                                  "えへへありがとう！そーいえばさー明日提出の課題終わってないんだよねー",
                                  "わーいありがとうそういえばﾀﾅｶ君なんか元気ないね",
                                  "そwれwはw大変だねw……",
                                  "あのさ…私と話して楽しい？",
                                  "本当！よかったーねえ！ﾀﾅｶ君って彼女いる？",
                                  "えっいいけど",
                                  "って話って何？",
                                  "……!本当に本当？ドッキリじゃない？",
                                  "あはははそうだよね…実は私も好きだった",
                                  "両思いだったてことだよ！ねえ付き合ってもいいけど絶対離れないでね！",
                                  "どうしたの？考えこと？",
                                  " そっかじゃあ行こっか"]
    
    var tanakatakai: [String] = ["髪型変えた？",
                                 "よく似合ってる",
                                 "俺終わってるから見せようか？"," 実は最近禿げてるって言われて…",
                                 "どうしたの？",
                                 "もちろん！",
                                 "いないよ",
                                 "いやなんでもない"]
    var tanakahutuu: [String] = ["なんか変わった？",
                                 "そんな変わらん",
                                 "おう頑張れ",
                                 " ん？気のせいじゃない？",
                                 "何見てるの？",
                                 "普通に楽しいしおもろしろい",
                                 "知らない",
                                 "特に何も？"]
    var tanakahikui: [String] = ["シャンプー変えた？",
                                 " 前の方が可愛かった",
                                 "しっかりやっておけばよかったのに"
                                 ,"別にいう必要はない",
                                 "……",
                                 "うーん普通？",
                                 "もちろんいるよ！（二次元彼女）",
                                 "しょうもないことだよ"]
}
